# Модуль
# Генератори.Функції вищих порядків.
# Декоратори.Модулі.Тестування
# API
# Тема: Генератори.Функції вищих порядків.Декоратори.
# Частина 2
#
# Завдання
# 1
# Створітьфункцію, якаповертає всі числа Фібоначчі в діапазоні.Функція приймає початок і кінець діапазону як
# параметри.Використовуйте механізм генераторів усередині функції.  Числа Фібоначчі — це послідовність чисел, де кожне
# наступне число є сумою двох попередніх.Послідовність починається з 0 і 1, а наступні числа
# визначаються за формулою:
#
# F(0) = 0
#
# F(1) = 1
#
# F(n) = F(n - 1) + F(n - 2), для
# n > 1.
def fibonacci(start, end):
    a = 0
    b = 1
    while a <= end:
        if a >= start:
            yield a

        temp = a
        a = b
        b = temp + b

start = 0
end = 20
for num in fibonacci(start, end):
    print(num)